/**
@mainpage Умный калькулятор с возможностью строить графики
@ref CREDIT Кредитный калькулятор с 2 типа кредитования\n
@ref DEBET Калькулятор доходности с возможностью капитализации
@author kareemto
@version 2.0
@date Март 2024 года
@page CREDIT
@brief Дает возможность рассчитать кредит с 2 типами платежей(аннуитетный и
дифференцированные). Выводит общую сумму платежей по месяцам с расшифровкой
погашения основной части и кредита, а также остаток долга).
@page DEBET
@brief Калькулятор доходности с возможностью капитализации процентов и
рассчитать налог (учитывая ставку цб на 16.02.2024 в 16%, ставка
пересматривается каждый год, поэтому невозможно точно рассчитать налог), ввести
дополнительные даты пополнения или снятия денег.
*/
